KanatERPSukhova.КанатАдаптация/src/DataProcessors/КАНАТ_ПечатьСпецификацииЗаказКлиента/КАНАТ_ПечатьСпецификацииЗаказКлиента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>КАНАТ_ПечатьСпецификацииЗаказКлиента</name>
</mdclass:DataProcessor>

KanatERPSukhova.КанатАдаптация/src/InformationRegisters/КАНАТ_ЛицаПодписывающиеЗаПодразделения/КАНАТ_ЛицаПодписывающиеЗаПодразделения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КАНАТ_ЛицаПодписывающиеЗаПодразделения</name>
  <dimensions>
    <name>РольРуководителя</name>
    <type>
      <types>EnumRef.КАНАТ_РолиПодписантов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Замещающий</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

KanatERPSukhova.КанатАдаптация/src/Enums/КАНАТ_РолиПодписантов/КАНАТ_РолиПодписантов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КАНАТ_РолиПодписантов</name>
  <enumValues>
    <name>РуководительЛаборатории</name>
  </enumValues>
  <enumValues>
    <name>РуководительТехОтдела</name>
  </enumValues>
  <enumValues>
    <name>РуководительОУКП</name>
  </enumValues>
  <enumValues>
    <name>СтОператорЭВМ</name>
  </enumValues>
  <enumValues>
    <name>ТехникЛаборант</name>
  </enumValues>
  <enumValues>
    <name>ГенДиректор</name>
  </enumValues>
  <enumValues>
    <name>ВедИнженерТехнолог</name>
  </enumValues>
</mdclass:Enum>

KanatERPSukhova.КанатАдаптация/src/Enums/ВариантыОтсчетаДатыПлатежа/ВариантыОтсчетаДатыПлатежа.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="5abb70ea-0663-4378-919d-0ea83e97d3dc">
  <name>ВариантыОтсчетаДатыПлатежа</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="b690e4c2-e9a8-40ea-8b8b-fea31617f479">
    <name>ОтДатыОтгрузки</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

KanatERPSukhova.КанатАдаптация/src/Documents/КАНАТ_СпецификацияКДоговору/КАНАТ_СпецификацияКДоговору.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>КАНАТ_СпецификацияКДоговору</name>
  <attributes>
    <name>ПорядковыйНомер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Соглашение</name>
    <type>
      <types>CatalogRef.СоглашенияСКлиентами</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ЗаказКлиента</types>
    </type>
  </attributes>
  <attributes>
    <name>КАНАТ_НомерИДатаДоверенности</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КАНАТ_ФИОСопроводителя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КАНАТ_Водитель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КАНАТ_ГосНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КАНАТ_АвтомобильМарка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СпособДоставки</name>
    <type>
      <types>EnumRef.СпособыДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресДоставки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КАНАТ_ПримечаниеКСпецификацииДоговора</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КАНАТ_ДоставкаСпецификацияКДоговору</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>400</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КАНАТ_ПлатитЗаДоставку</name>
    <type>
      <types>EnumRef.КАНАТ_ПлатитЗаДоставку</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаБезНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>CatalogRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КАНАТ_КомментарийКЗаказу</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>400</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

KanatERPSukhova.КанатАдаптация/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="3404cb9a-92ea-42b9-9086-ad481dbc27d7">
  <name>ДоговорыКонтрагентов</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>КАНАТ_ХранилищеИтоговыйТекст</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>КАНАТ_ПоСоглашению</name>
    <type>
      <types>CatalogRef.СоглашенияСКлиентами</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="d4de0c91-22dd-4ce4-bc98-884061653165">
    <name>ГосударственныйКонтракт</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="9b99d944-1b87-423e-a8a0-f6748f86530b">
    <name>НаименованиеДляПечати</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="f56e0158-d692-474d-bb59-3cb9fe0131ae">
    <name>Сумма</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ec175e6e-8a0f-46c1-8f61-1933ed068350">
    <name>ДоговорСУчастникомГОЗ</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c2821c1b-dcf2-47d6-9871-b26fe7c33e1f">
    <name>Номер</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="a00d91d9-5c1d-491a-b338-92dc631c1afd">
    <name>Дата</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="ba089968-9caa-4200-9002-b8f3267b4b61">
    <name>КонтактноеЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="6fe24eab-4e23-451e-8cae-c25d6e78e3df">
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections>
    <name>КАНАТ_БлокиДоговора</name>
    <attributes>
      <name>БлокДоговора</name>
      <type>
        <types>CatalogRef.КАНАТ_БлокиДоговоров</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

KanatERPSukhova.КанатАдаптация/src/Catalogs/КонтактныеЛицаПартнеров/КонтактныеЛицаПартнеров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="877a04b6-4c0b-4715-b826-6ac77909e040">
  <name>КонтактныеЛицаПартнеров</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <owners>Checked</owners>
  </extension>
  <owners>Catalog.Партнеры</owners>
  <attributes>
    <name>КАНАТ_ДанныеДоверенности</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КАНАТ_Подписант</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="79835be6-c08e-48a0-851c-e3c4da4d8a47">
    <name>ДатаПрекращенияСвязи</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="cd170420-6eb1-4342-ac01-7cc15a278469">
    <name>Пол</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="29cd916a-e579-4b2a-8c42-645cfd2a9521">
    <name>ДолжностьПоВизитке</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="fad70dd9-2de6-4bf6-8dbb-73c8ae806377">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="67d2f639-09f9-487b-aefa-c42471c9026b">
    <name>ДатаРегистрацииСвязи</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="29f8edc3-bc77-4470-9bc6-b58b2924f54d">
    <name>Автор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="07a989fe-b7de-44b6-839d-e1cce1d2d423">
    <name>ДатаРождения</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <tabularSections extendedConfigurationObject="2f4a3620-e144-45ef-983d-c08853b9c00d">
    <name>РолиКонтактногоЛица</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="3e546e08-a859-49f2-9d04-c9fdb5547183">
      <name>РольКонтактногоЛица</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

KanatERPSukhova.КанатАдаптация/src/DataProcessors/КАНАТ_ПечатьСпецификацииЗаказКлиента/ManagerModule.bsl
// Формирует печатные формы.
//
// Параметры:
//  МассивОбъектов - см. УправлениеПечатьюПереопределяемый.ПриПечати.МассивОбъектов
//  ПараметрыПечати - см. УправлениеПечатьюПереопределяемый.ПриПечати.ПараметрыПечати
//  КоллекцияПечатныхФорм - см. УправлениеПечатьюПереопределяемый.ПриПечати.КоллекцияПечатныхФорм
//  ОбъектыПечати - см. УправлениеПечатьюПереопределяемый.ПриПечати.ОбъектыПечати
//  ПараметрыВывода - см. УправлениеПечатьюПереопределяемый.ПриПечати.ПараметрыВывода
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Для Каждого Документ Из МассивОбъектов Цикл
		
		//Если ТипЗнч(Документ) = Тип("ДокументСсылка.КАНАТ_СпецификацияКДоговору") Тогда
		//	Док = Документ.ДокументОснование;
		//Иначе
		//	Док = Документ;
		//КонецЕсли;
		
		Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПечатьСпецификации") Тогда
			СтруктураТипов = ОбщегоНазначенияУТ.СоответствиеМассивовПоТипамОбъектов(МассивОбъектов);
			УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
				КоллекцияПечатныхФорм,
				"ПечатьСпецификации",
				"Печать спецификации",
				СформироватьПечатьСпецификации(Документ));
		КонецЕсли;
	
	КонецЦикла;
	ФормированиеПечатныхФорм.ЗаполнитьПараметрыОтправки(ПараметрыВывода.ПараметрыОтправки, МассивОбъектов, КоллекцияПечатныхФорм);
	
КонецПроцедуры

//++ Гурьев 04.09.23 формирование печатной формы для печати спецификации
Функция СформироватьПечатьСпецификации(Документ)
	
	ДанныеПечати = ПолучитьДанныеПечати(Документ);
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	Макет = УправлениеПечатью.МакетПечатнойФормы("Обработка.КАНАТ_ПечатьСпецификацииЗаказКлиента.ПФ_MXL_ПечатьСпецификакии");
	ОбластьПустаяСтрока = Макет.ПолучитьОбласть("ОбластьПустаяСтрока");
	//Шапка
	ОбластьШапка = Макет.ПолучитьОбласть("ОбластьШапка");
	ДанныеШапки = Новый Структура;
	ДанныеШапки.Вставить("НомерСпецификации",       ДанныеПечати[0].КАНАТ_СпецификацияНомер);
	ДанныеШапки.Вставить("НомерДоговора",           ДанныеПечати[0].НомерДоговора);
	ДанныеШапки.Вставить("ДатаДоговора",            Формат(ДанныеПечати[0].ДатаДоговора,"ДФ=dd.MM.yyyy"));
	ДанныеШапки.Вставить("ОрганизацияНаименование", ДанныеПечати[0].ОрганизацияНаименование);
	ДанныеШапки.Вставить("КонтрагентНаименование",  ДанныеПечати[0].КонтрагентСокрНаименование);
	ОбластьШапка.Параметры.Заполнить(ДанныеШапки);
	
	ТабличныйДокумент.Вывести(ОбластьШапка);
	ТабличныйДокумент.Вывести(ОбластьПустаяСтрока);
	
	ОбластьШапкаДатаАдрес = Макет.ПолучитьОбласть("ОбластьШапкаДатаАдрес");
	ДанныеШапкаДатаАдрес = Новый Структура;
	ДанныеШапкаДатаАдрес.Вставить("Дата",  Формат(ДанныеПечати[0].КАНАТ_ДатаСпецификации,"ДФ=dd.MM.yyyy; ДП='-'"));
	ДанныеШапкаДатаАдрес.Вставить("Адрес", "г. Коломна Московская обл.");
	ОбластьШапкаДатаАдрес.Параметры.Заполнить(ДанныеШапкаДатаАдрес);
	
	ТабличныйДокумент.Вывести(ОбластьШапкаДатаАдрес);
	ТабличныйДокумент.Вывести(ОбластьПустаяСтрока);
	
	ОбластьШапкаУсловия = Макет.ПолучитьОбласть("ОбластьШапкаУсловия");
	
	ТабличныйДокумент.Вывести(ОбластьШапкаУсловия);
	ТабличныйДокумент.Вывести(ОбластьПустаяСтрока);
	
	//Таблица
	ОбластьТаблицаШапка = Макет.ПолучитьОбласть("ОбластьТаблицаШапка");
	ТабличныйДокумент.Вывести(ОбластьТаблицаШапка);
	
	СуммаИтого = 0;
	
	Для Каждого Строка Из ДанныеПечати Цикл 
		
		ОбластьТаблицаСтрока = Макет.ПолучитьОбласть("ОбластьТаблицаСтрока");
		ОбластьТаблицаСтрока.Параметры.Заполнить(Строка);
		ТабличныйДокумент.Вывести(ОбластьТаблицаСтрока);
		
		СуммаИтого = СуммаИтого + Строка.СуммаСНДС;
		
	КонецЦикла;
	
	ОбластьТаблицаИтого = Макет.ПолучитьОбласть("ОбластьТаблицаИтого");
	ДанныеТаблицаИтого = Новый Структура;
	ДанныеТаблицаИтого.Вставить("ИтогоСумма", СуммаИтого);
	ОбластьТаблицаИтого.Параметры.Заполнить(ДанныеТаблицаИтого);
	ТабличныйДокумент.Вывести(ОбластьТаблицаИтого);
	ТабличныйДокумент.Вывести(ОбластьПустаяСтрока);
	
	//Комментарии
	ОбластьКомментарии = Макет.ПолучитьОбласть("ОбластьКомментарии");
	ДанныеОбластьКомментарии = Новый Структура;
	ДанныеОбластьКомментарии.Вставить("Примечание",      ДанныеПечати[0].КАНАТ_ПримечаниеКСпецификацииДоговора);
	ДанныеОбластьКомментарии.Вставить("ДанныеДоставка",  ДанныеПечати[0].КАНАТ_ДоставкаСпецификацияКДоговору);
	ДанныеОбластьКомментарии.Вставить("Дата",            Формат(ДанныеПечати[0].КАНАТ_ДатаСпецификации,"ДФ=dd.MM.yyyy; ДП='-'"));
	ДанныеОбластьКомментарии.Вставить("УсловияОплаты",   ПолучитьДанныеОплаты(Документ.ДокументОснование));
	//ДанныеОбластьКомментарии.Вставить("СпособОтгрузки",  ДанныеПечати[0].СпособДоставки);
	//ДанныеОбластьКомментарии.Вставить("Грузополучатель", ДанныеПечати[0].Грузополучатель);
	ДанныеОбластьКомментарии.Вставить("НомерДоговора",   ДанныеПечати[0].НомерДоговора);
	ДанныеОбластьКомментарии.Вставить("ДатаДоговора",    Формат(ДанныеПечати[0].ДатаДоговора,"ДФ=dd.MM.yyyy; ДП='-'"));
	ОбластьКомментарии.Параметры.Заполнить(ДанныеОбластьКомментарии);
	ТабличныйДокумент.Вывести(ОбластьКомментарии);
	ТабличныйДокумент.Вывести(ОбластьПустаяСтрока);
	
	//Подвал
	ОбластьПодвал = Макет.ПолучитьОбласть("ОбластьПодвал");
	ДанныеПодвал = Новый Структура;
	//ДанныеПодвал.Вставить("Поставщик",  ?(ЗначениеЗаполнено(ДанныеПечати[0].Руководитель),
	//									  ФизическиеЛицаКлиентСервер.ФамилияИнициалы(ДанныеПечати[0].Руководитель),
	//									  ""));
	Поставщик = РегистрыСведений.КАНАТ_ЛицаПодписывающиеЗаПодразделения.ПолучитьСотрудникаПоДолжности(Перечисления.КАНАТ_РолиПодписантов.ГенДиректор, ДанныеПечати[0].КАНАТ_ДатаСпецификации);
	ДанныеПодвал.Вставить("Поставщик",  ?(ЗначениеЗаполнено(Поставщик),
										  ФизическиеЛицаКлиентСервер.ФамилияИнициалы(Поставщик.Наименование),
										  ""));
	ДанныеПодвал.Вставить("ПоставщикДолжность", "Ген. директор");
	
	ПокупательСтруктура = ПолучитьПокупателя(ДанныеПечати[0].Контрагент);
	//ДанныеПодвал.Вставить("Покупатель", ?(ЗначениеЗаполнено(ДанныеПечати[0].КонтактноеЛицо),
	//									  ФизическиеЛицаКлиентСервер.ФамилияИнициалы(ДанныеПечати[0].КонтактноеЛицо),
	//									  ""));
	ДанныеПодвал.Вставить("ПокупательДолжность", ПокупательСтруктура.Должность);
	ДанныеПодвал.Вставить("Покупатель", ФизическиеЛицаКлиентСервер.ФамилияИнициалы(ПокупательСтруктура.Наименование));
	
	ОбластьПодвал.Параметры.Заполнить(ДанныеПодвал);
	ТабличныйДокумент.Вывести(ОбластьПодвал);
	ТабличныйДокумент.Вывести(ОбластьПустаяСтрока);
	
	//Скидки
	Если ДанныеПечати[0].ВыводитьСкидки Тогда
		Скидки = ДействиеСкидокНаценокПоИсточнику(Константы.КАНАТ_СоглашениеДляТиповогоТекстаСкидок.Получить(), ТекущаяДата());
		Если Скидки.Количество() > 0 Тогда
			
			ОбластьСкидка = Макет.ПолучитьОбласть("ОбластьСкидка");
			ТекстСкидки = "";
			Для Каждого Скидка Из Скидки Цикл
				
				ТекстСкидки = ТекстСкидки + Скидка.Наименование + Символы.ПС;
				
			КонецЦикла;
			
			ОбластьСкидка.Параметры.ТекстСкидки = ТекстСкидки;
			ТабличныйДокумент.Вывести(ОбластьСкидка);
			
		КонецЕсли;
	КонецЕсли;
	
	Возврат ТабличныйДокумент;
	
КонецФункции
//-- Гурьев 04.09.23

Функция ПолучитьДанныеПечати_устар(Документ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаказКлиента.КАНАТ_СпецификацияНомер КАК КАНАТ_СпецификацияНомер,
	|	ДоговорыКонтрагентов.Номер КАК НомерДоговора,
	|	ДоговорыКонтрагентов.Дата КАК ДатаДоговора,
	|	ЗаказКлиента.Организация.Наименование КАК ОрганизацияНаименование,
	|	ЗаказКлиента.Контрагент.Наименование КАК КонтрагентНаименование,
	|	ЗаказКлиента.КАНАТ_ДатаСпецификации КАК КАНАТ_ДатаСпецификации,
	|	ЗаказКлиентаТовары.КАНАТ_КомментарийКЗаказу КАК КАНАТ_КомментарийКЗаказу,
	|	ЗаказКлиентаТовары.Номенклатура.Наименование КАК НоменклатураНаименование,
	|	ЗаказКлиентаТовары.Количество КАК Количество,
	|	ЗаказКлиентаТовары.СтавкаНДС КАК СтавкаНДС,
	|	ЗаказКлиентаТовары.СуммаСНДС КАК СуммаСНДС,
	|	ЗаказКлиентаТовары.Цена КАК Цена,
	|	ЗаказКлиентаТовары.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ЗаказКлиента.СпособДоставки КАК СпособДоставки,
	|	ЗаказКлиента.Грузополучатель КАК Грузополучатель,
	|	ЗаказКлиента.Руководитель.ФизическоеЛицо.ФИО КАК Руководитель,
	|	ДоговорыКонтрагентов.КонтактноеЛицо.Наименование КАК КонтактноеЛицо,
	|	ЕСТЬNULL(СоглашенияСКлиентами.КАНАТ_ВыводитьСкидки, ЛОЖЬ) КАК ВыводитьСкидки
	|ИЗ
	|	Документ.ЗаказКлиента КАК ЗаказКлиента
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ПО ЗаказКлиента.Договор = ДоговорыКонтрагентов.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
	|		ПО ЗаказКлиента.Ссылка = ЗаказКлиентаТовары.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СоглашенияСКлиентами КАК СоглашенияСКлиентами
	|		ПО ЗаказКлиента.Соглашение = СоглашенияСКлиентами.Ссылка
	|ГДЕ
	|	ЗаказКлиента.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Документ);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция ПолучитьДанныеОплаты(Документ) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказКлиентаЭтапыГрафикаОплаты.ПроцентПлатежа КАК ПроцентПлатежа,
		|	ЗаказКлиентаЭтапыГрафикаОплаты.ВариантОтсчета КАК ВариантОтсчета
		|ИЗ
		|	Документ.ЗаказКлиента.ЭтапыГрафикаОплаты КАК ЗаказКлиентаЭтапыГрафикаОплаты
		|ГДЕ
		|	ЗаказКлиентаЭтапыГрафикаОплаты.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Документ);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		
		Возврат "По договору"
		
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	
	ПроцентПредоплаты = 0;
	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.ВариантОтсчета <> Перечисления.ВариантыОтсчетаДатыПлатежа.ОтДатыОтгрузки Тогда
			
			ПроцентПредоплаты = ПроцентПредоплаты + Выборка.ПроцентПлатежа;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если ПроцентПредоплаты > 0 Тогда 
		
		Возврат "Предоплата " + Строка(ПроцентПредоплаты) + "%";
		
	Иначе
		
		Возврат "Постоплата";
		
	КонецЕсли;
	
КонецФункции

Функция ДействиеСкидокНаценокПоИсточнику(Источник, Дата)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ДействиеСкидокНаценокСрезПоследних.СкидкаНаценка                                                              КАК СкидкаНаценка,
	|	ЕСТЬNULL(ДействиеСкидокНаценокСрезПоследних.Статус, ЗНАЧЕНИЕ(Перечисление.СтатусыДействияСкидок.НеДействует)) КАК Статус,
	|	
	|	ВЫБОР
	|		КОГДА ДействиеСкидокНаценокСрезПоследних.Статус ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК Использование,
	|	
	|	ЕСТЬNULL(ДействиеСкидокНаценокСрезПоследних.Период, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаНачала,
	|	
	|	ВЫБОР КОГДА ДействиеСкидокНаценокСрезПоследних.Период ЕСТЬ NULL ТОГДА
	|		ЕСТЬNULL(ДобавитьКДате(ДействиеСкидокНаценокСрезПервых.Период, ДЕНЬ, -1), ДАТАВРЕМЯ(1, 1, 1)) 
	|	ИНАЧЕ
	|		ЕСТЬNULL(ДобавитьКДате(Таблица.Период, ДЕНЬ, -1), ДАТАВРЕМЯ(1, 1, 1))
	|	КОНЕЦ КАК ДатаОкончания,
	|	ТаблицаСкидкиНаценки.Наименование КАК Наименование
	|	
	|ИЗ
	|	Справочник.СкидкиНаценки КАК ТаблицаСкидкиНаценки
	|		
	|		ЛЕВОЕ СОЕДИНЕНИЕ
	|			РегистрСведений.ДействиеСкидокНаценок.СрезПоследних(&ДатаСреза, Источник = &Источник) КАК ДействиеСкидокНаценокСрезПоследних
	|			ПО ДействиеСкидокНаценокСрезПоследних.СкидкаНаценка = ТаблицаСкидкиНаценки.Ссылка
	|		
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			МИНИМУМ(Т.Период) КАК Период,
	|			Т.СкидкаНаценка КАК СкидкаНаценка
	|		ИЗ
	|			РегистрСведений.ДействиеСкидокНаценок.СрезПоследних(&ДатаСреза, Источник = &Источник) КАК Срез
	|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДействиеСкидокНаценок КАК Т
	|				ПО (Т.СкидкаНаценка = Срез.СкидкаНаценка)
	|					И Т.Источник = Срез.Источник
	|					И Т.Период > Срез.Период
	|					И Т.Статус <> Срез.Статус
	|		СГРУППИРОВАТЬ ПО
	|			Т.СкидкаНаценка) КАК Таблица
	|		ПО (Таблица.СкидкаНаценка = ТаблицаСкидкиНаценки.Ссылка)
	|		
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДействиеСкидокНаценок.СрезПервых(
	|				&ДатаСреза,
	|				Источник = &Источник) КАК ДействиеСкидокНаценокСрезПервых
	|		ПО ДействиеСкидокНаценокСрезПервых.СкидкаНаценка = ТаблицаСкидкиНаценки.Ссылка
	|ГДЕ
	|	    (НЕ ДействиеСкидокНаценокСрезПоследних.Период ЕСТЬ NULL
	|	ИЛИ НЕ ДействиеСкидокНаценокСрезПервых.Период ЕСТЬ NULL)
	|	И ЕСТЬNULL(ДействиеСкидокНаценокСрезПоследних.Статус, ЗНАЧЕНИЕ(Перечисление.СтатусыДействияСкидок.НеДействует)) = ЗНАЧЕНИЕ(Перечисление.СтатусыДействияСкидок.Действует)
	|");
	
	Запрос.УстановитьПараметр("ДатаСреза", Дата);
	Запрос.УстановитьПараметр("Источник", Источник);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция ПолучитьДанныеПечати(Документ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДоговорыКонтрагентов.Номер КАК НомерДоговора,
	|	ДоговорыКонтрагентов.Дата КАК ДатаДоговора,
	|	ЗаказКлиента.Организация.Наименование КАК ОрганизацияНаименование,
	|	ЗаказКлиента.Руководитель.ФизическоеЛицо.ФИО КАК Руководитель,
	|	ДоговорыКонтрагентов.КонтактноеЛицо.Наименование КАК КонтактноеЛицо,
	|	ЕСТЬNULL(СоглашенияСКлиентами.КАНАТ_ВыводитьСкидки, ЛОЖЬ) КАК ВыводитьСкидки,
	|	МАКСИМУМ(КАНАТ_СпецификацияКДоговору.ПорядковыйНомер) КАК КАНАТ_СпецификацияНомер,
	|	КАНАТ_СпецификацияКДоговору.Контрагент.Наименование КАК КонтрагентНаименование,
	|	КАНАТ_СпецификацияКДоговору.Контрагент.НаименованиеПолное КАК КонтрагентСокрНаименование,
	|	КАНАТ_СпецификацияКДоговору.Дата КАК КАНАТ_ДатаСпецификации,
	|	КАНАТ_СпецификацияКДоговоруТовары.Номенклатура.Наименование КАК НоменклатураНаименование,
	|	СУММА(КАНАТ_СпецификацияКДоговоруТовары.Количество) КАК Количество,
	|	КАНАТ_СпецификацияКДоговоруТовары.СтавкаНДС КАК СтавкаНДС,
	|	СУММА(КАНАТ_СпецификацияКДоговоруТовары.СуммаСНДС) КАК СуммаСНДС,
	|	КАНАТ_СпецификацияКДоговоруТовары.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	КАНАТ_СпецификацияКДоговоруТовары.КАНАТ_КомментарийКЗаказу КАК КАНАТ_КомментарийКЗаказу,
	|	КАНАТ_СпецификацияКДоговоруТовары.СуммаБезНДС / КАНАТ_СпецификацияКДоговоруТовары.Количество КАК Цена,
	|	КАНАТ_СпецификацияКДоговору.КАНАТ_ПримечаниеКСпецификацииДоговора КАК КАНАТ_ПримечаниеКСпецификацииДоговора,
	|	КАНАТ_СпецификацияКДоговору.КАНАТ_ДоставкаСпецификацияКДоговору КАК КАНАТ_ДоставкаСпецификацияКДоговору,
	|	КАНАТ_СпецификацияКДоговору.Контрагент КАК Контрагент
	|ИЗ
	|	Документ.КАНАТ_СпецификацияКДоговору КАК КАНАТ_СпецификацияКДоговору
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента КАК ЗаказКлиента
	|		ПО КАНАТ_СпецификацияКДоговору.ДокументОснование = ЗаказКлиента.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.КАНАТ_СпецификацияКДоговору.Товары КАК КАНАТ_СпецификацияКДоговоруТовары
	|		ПО (КАНАТ_СпецификацияКДоговоруТовары.Ссылка = КАНАТ_СпецификацияКДоговору.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ПО КАНАТ_СпецификацияКДоговору.Договор = ДоговорыКонтрагентов.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СоглашенияСКлиентами КАК СоглашенияСКлиентами
	|		ПО КАНАТ_СпецификацияКДоговору.Соглашение = СоглашенияСКлиентами.Ссылка
	|ГДЕ
	|	КАНАТ_СпецификацияКДоговору.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ДоговорыКонтрагентов.Номер,
	|	ДоговорыКонтрагентов.Дата,
	|	ЗаказКлиента.Организация.Наименование,
	|	ЗаказКлиента.Руководитель.ФизическоеЛицо.ФИО,
	|	ДоговорыКонтрагентов.КонтактноеЛицо.Наименование,
	|	ЕСТЬNULL(СоглашенияСКлиентами.КАНАТ_ВыводитьСкидки, ЛОЖЬ),
	|	КАНАТ_СпецификацияКДоговору.Контрагент.Наименование,
	|	КАНАТ_СпецификацияКДоговору.Контрагент.НаименованиеПолное,
	|	КАНАТ_СпецификацияКДоговору.Дата,
	|	КАНАТ_СпецификацияКДоговоруТовары.Номенклатура.Наименование,
	|	КАНАТ_СпецификацияКДоговоруТовары.СтавкаНДС,
	|	КАНАТ_СпецификацияКДоговоруТовары.Номенклатура.ЕдиницаИзмерения,
	|	КАНАТ_СпецификацияКДоговоруТовары.КАНАТ_КомментарийКЗаказу,
	|	КАНАТ_СпецификацияКДоговору.Контрагент,
	|	КАНАТ_СпецификацияКДоговору.КАНАТ_ПримечаниеКСпецификацииДоговора,
	|	КАНАТ_СпецификацияКДоговору.КАНАТ_ДоставкаСпецификацияКДоговору,
	|	КАНАТ_СпецификацияКДоговоруТовары.СуммаБезНДС / КАНАТ_СпецификацияКДоговоруТовары.Количество";
	
	Запрос.УстановитьПараметр("Ссылка", Документ);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция ПолучитьПокупателя(Контрагент)
	
	Результат = Новый Структура;
	Результат.Вставить("Наименование", "");
	Результат.Вставить("Должность", "");
	
	Если ЗначениеЗаполнено(Контрагент) И ЗначениеЗаполнено(Контрагент.Партнер) Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	КонтактныеЛицаПартнеров.Наименование КАК Наименование,
			|	КонтактныеЛицаПартнеров.ДолжностьПоВизитке КАК ДолжностьПоВизитке
			|ИЗ
			|	Справочник.КонтактныеЛицаПартнеров КАК КонтактныеЛицаПартнеров
			|ГДЕ
			|	КонтактныеЛицаПартнеров.Владелец = &Владелец
			|	И КонтактныеЛицаПартнеров.КАНАТ_Подписант = ИСТИНА";
		
		Запрос.УстановитьПараметр("Владелец", Контрагент.Партнер);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Результат.Наименование = ВыборкаДетальныеЗаписи.Наименование;
			Результат.Должность = ВыборкаДетальныеЗаписи.ДолжностьПоВизитке;
		КонецЦикла;
		
	КонецЕсли;

	Возврат Результат;
	
КонецФункции
